{
  "HomePage": {
    "title": "BETTERMEMORY",
    "about": " is transforming how we learn and retain knowledge. By harnessing advanced algorithms and neuroscience insights, we create innovative solutions that enhance memory and accelerate learning. Our mission is to empower individuals to reach their full potential, making education more personalized, effective, and engaging for learners today and the visionaries of tomorrow.",
    "about-2": "We’re in the initial phases of development and will be sharing more updates in the near future!",
    "about-text": "company",
    "modaleCompany": "Company",
    "BlogAbout": "All research and articles published by BETTERMEMORY.",
    "StayBlog": "Blog Updates Coming Soon, Please Stay Tuned!",
    "InputText": "Type your email...",
    "Subscribe": "Subscribe",
    "WaitSubscribe": "Sending...",
    "SubscribeError": "Failed to send, please check if the email is filled in correctly.",
    "": ""
  },
  "Modal": {
    "ModalTitle": "language",
    "ModalTitle2": "Language",
    "BlogText": "blog",
    "ProductText": "product"
  },
  "blog-1": {
    "title": "Blog Updates Coming Soon, Please Stay Tuned!",
    "date": "17.January 2025",
    "author": "BETTERMEMORY LTD",
    "content": "We are about to publish our first blog post, which will be available in multiple languages, including English, Traditional Chinese, Korean, and Japanese. The post will cover our current progress and future plans. Stay tuned!"
  },
  "blog-2": {
    "title": "Watching videos vs. reading, why we choose reading.",
    "date": "17.January 2025",
    "author": "VinKon",
    "content": "Learners commonly acquire knowledge through two primary methods: watching videos or reading text. Based on our research and analysis, we found that videos, as a medium for delivering information, often prioritize engagement and completion rates during production. While this approach helps capture the audience's attention, it also results in lower information density. As a result, the effectiveness of video-based learning can sometimes be suboptimal.",
    "content-2": "Given this observation, we chose not to adopt the video-based educational model commonly used by platforms such as * in our product development. Instead, we opted for a text-centered approach to information delivery.",
    "content-3": "When watching videos, users are required to process multiple streams of input simultaneously, such as visual content, background music, narration, and subtitles. This multitasking nature of video consumption can easily distract the learner's attention. In contrast, reading text allows users to focus more effectively, as it usually occurs in a quiet environment with information limited to the written content. Consequently, text-based information delivery proves to be significantly more efficient than video-based methods."
  }
}
